app/Http/Controllers/CategoryController.php

select * from `posts` inner join `categories` on `category_id` = `categories`.`id` where `name` like '%History%'
select * from `categories`
---
    public function index(Request $request)
    {
        //return "hello";
        if($request->search){
            $posts=Post::join('categories','category_id','=','categories.id')
                ->where('name','like','%'.$request->search.'%')->get();

            //return "helloo";
            return view('posts.index', compact('posts'));
        }
        //second tessssssssssst
        $categories =Category::all();