app/Http/Controllers/PostController.php

select * from `posts` inner join `users` on `author_id` = `users`.`id` where `title` like '%angkon%' or `descr` like '%angkon%' or `name` like '%angkon%' order by `posts`.`created_at` desc
select * from `posts` inner join `users` on `author_id` = `users`.`id` order by `posts`.`created_at` desc limit 4 offset 0
select count(*) as aggregate from `posts` inner join `users` on `author_id` = `users`.`id`
---
    public function index(Request $request)
    {
        if ($request->search) {
            $posts = Post::join('users', 'author_id', '=', 'users.id')
                ->where('title', 'like', '%'.$request->search.'%')
                ->orWhere('descr', 'like', '%'.$request->search.'%')
                ->orWhere('name', 'like', '%'.$request->search.'%')
                ->orderBy('posts.created_at', 'desc')
                ->get();
            return view('posts.index', compact('posts'));
        }

        $posts = Post::join('users', 'author_id', '=', 'users.id')
                 ->orderBy('posts.created_at', 'desc')
                 ->paginate(4);

select * from `categories`
select * from `tags`
---
    public function create()
    {
        $categories=Category::all();
        $tags=Tag::all();