app/Http/Controllers/TagController.php

select * from `tags`
---
    public function index()
    {
        $tags= Tag::all();